In [3]:
import sqlite3
import pandas as pd
import numpy as np

db = sqlite3.connect('School.sqlite')

In [5]:
data = pd.read_sql_query('Select * from Student', db)
data

## read_sql_query will return table in the form of dataframe
## The dataframe is stored in the data variable.
## We can use that data variable to use that particular dataframe.

   RollNumber        Name  Age
0         101        Aman   30
1         102        Amit   20
2         103       Mohit   32
3         104  Amit kumar   30
4         105       Nidhi   30
5         106     Manisha   30
6         107      Ankush   30

In [7]:
data[data['Age'] == 30]

   RollNumber        Name  Age
0         101        Aman   30
3         104  Amit kumar   30
4         105       Nidhi   30
5         106     Manisha   30
6         107      Ankush   30

In [8]:
## Create a new table using pandas
## For that we need to first create a dataframe where we pass values of rows in a list where each row value is passed in list
## and then we specify column name


data = pd.DataFrame([[201, 'Aman', 'English', 20000], [202, 'Komal', 'Maths', 22000], [203, 'Mahesh', 'Science', 23000]],
                    columns = ['ID', 'Name', 'Course', 'Salary'])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [9]:
## After creating dataframe, we then use to_sql() where we pass Table name and then pass connection object i.e. db.
## We can check on db browser that table is created.


data.to_sql("Faculty", db)

In [12]:
## To add new column in dataframe
data = pd.read_sql_query('Select * from Student', db)
data['Address'] = 'Test'


## Now as we have added the column in dataframe, to update it inside the dataframe, we use to_sql().
## Then we add new parameter if_exists = 'replace'.
## It means that it will check if the table exists or not, if exists it will replace it with this one.


data.to_sql("Student", db, if_exists = 'replace')